const themeColor = ['#00DDFF', '#80FFA5', '#37A2FF', '#FF0087', '#FFBF00']

export const allData = {
  color: themeColor,
  pieChartData: {
    title: '全部产品分布',
    data: [
      { value: 400, name: '自选版' },
      { value: 1200, name: '升级版' },
      { value: 200, name: '基础版' },
    ],
  },
  stackedBarChartData: {
    title: '年龄段分部',
    xAxisData: ['20以下', '20-35', '35-50', '50-70', '70以上'],
    manData: [320, 332, 301, 334, 390],
    womanData: [120, 132, 101, 134, 90],
  },
  lineChartData: {
    title: '检测量',
    xAxisData: ['一月', '二月', '三月', '四月', '五月', '六月', '七月', '八月', '九月', '十月', '十一月', '十二月'],
    monthTestNum: [320, 332, 301, 334, 390, 330, 320, 270, 220, 230, 290, 350],
    allTestNum: [820, 932, 901, 934, 1290, 1330, 1320, 1280, 1260, 1280, 1350, 1370],
  },
  barChartData: {
    title: '癌肿风险占比',
    xAxisData: [
      '胃癌',
      '乳腺癌',
      '肝癌',
      '肺癌',
      '肠癌',
      '食管癌',
      '胰腺癌',
      '血液肿瘤',
      '脑瘤',
      '前列腺癌',
      '卵巢癌',
      '甲状腺癌',
      '鼻咽癌',
      '嗜铬细胞瘤',
    ],
    seriesData: [120, 200, 150, 80, 70, 110, 130, 120, 200, 150, 80, 70, 110, 130],
  },
  stackedAreaChartData: {
    title: '渠道商检测量',
    legendData: ['江苏海尔思', '河南中平韩一', '河南圣德医院'],
    xAxisData: ['一月', '二月', '三月', '四月', '五月', '六月', '七月', '八月', '九月', '十月', '十一月', '十二月'],
    seriesData: [
      {
        id: 1,
        name: '江苏海尔思',
        color: ['rgba(128, 255, 165)', 'rgba(1, 191, 236)'],
        data: [140, 232, 101, 264, 90, 340, 250, 140, 232, 101, 264, 90, 340, 250],
      },
      {
        id: 2,
        name: '河南中平韩一',
        color: ['rgba(0, 221, 255)', 'rgba(77, 119, 255)'],
        data: [120, 282, 111, 234, 220, 340, 310, 120, 282, 111, 234, 220, 140],
      },
      {
        id: 3,
        name: '河南圣德医院',
        color: ['rgba(55, 162, 255)', 'rgba(116, 21, 219)'],
        data: [320, 132, 201, 334, 190, 130, 220, 320, 132, 201, 334, 190, 330],
      },
    ],
  },
}

export const monthData = {
  color: themeColor,
  pieChartData: {
    title: '当月产品分布',
    data: [
      { value: 1200, name: '升级版' },
      { value: 200, name: '基础版' },
      { value: 400, name: '自选版' },
    ],
  },
  stackedBarChartData: {
    title: '年龄段分部',
    xAxisData: ['20以下', '20-35', '35-50', '50-70', '70以上'],
    manData: [220, 232, 331, 314, 350],
    womanData: [110, 122, 111, 144, 92],
  },
  lineChartData: {
    title: '检测量',
    xAxisData: ['一月', '二月', '三月', '四月', '五月', '六月', '七月', '八月', '九月', '十月', '十一月', '十二月'],
    monthTestNum: [320, 332, 301, 334, 390, 330, 320, 270, 220, 230, 290, 350],
    allTestNum: [820, 932, 901, 934, 1290, 1330, 1320, 1280, 1260, 1280, 1350, 1370],
  },
  barChartData: {
    title: '癌肿风险占比',
    xAxisData: [
      '胃癌',
      '乳腺癌',
      '肝癌',
      '肺癌',
      '肠癌',
      '食管癌',
      '胰腺癌',
      '血液肿瘤',
      '脑瘤',
      '前列腺癌',
      '卵巢癌',
      '甲状腺癌',
      '鼻咽癌',
      '嗜铬细胞瘤',
    ],
    seriesData: [60, 100, 75, 45, 35, 55, 65, 60, 90, 75, 40, 35, 55, 65],
  },
  stackedAreaChartData: {
    title: '渠道商检测量',
    legendData: ['江苏海尔思', '河南中平韩一', '河南圣德医院'],
    xAxisData: ['一月', '二月', '三月', '四月', '五月', '六月', '七月', '八月', '九月', '十月', '十一月', '十二月'],
    seriesData: [
      {
        id: 1,
        name: '江苏海尔思',
        color: ['rgba(0, 221, 255)', 'rgba(77, 119, 255)'],
        data: [120, 282, 111, 234, 220, 340, 310, 120, 282, 111, 234, 220, 140],
      },
      {
        id: 2,
        name: '河南中平韩一',
        color: ['rgba(55, 162, 255)', 'rgba(116, 21, 219)'],
        data: [140, 232, 101, 264, 90, 340, 250, 140, 232, 101, 264, 90, 340, 250],
      },
      {
        id: 3,
        name: '河南圣德医院',
        color: ['rgba(128, 255, 165)', 'rgba(1, 191, 236)'],
        data: [320, 132, 201, 334, 190, 130, 220, 320, 132, 201, 334, 190, 330],
      },
    ],
  },
}

export const lastMonthData = {
  color: themeColor,
  pieChartData: {
    title: '上月产品分布',
    data: [
      { value: 400, name: '自选版' },
      { value: 1200, name: '升级版' },
      { value: 200, name: '基础版' },
    ],
  },
  stackedBarChartData: {
    title: '年龄段分部',
    xAxisData: ['20以下', '20-35', '35-50', '50-70', '70以上'],
    manData: [120, 132, 101, 134, 90],
    womanData: [320, 332, 301, 334, 390],
  },
  lineChartData: {
    title: '检测量',
    xAxisData: ['一月', '二月', '三月', '四月', '五月', '六月', '七月', '八月', '九月', '十月', '十一月', '十二月'],
    monthTestNum: [320, 332, 301, 334, 390, 330, 320, 270, 220, 230, 290, 350],
    allTestNum: [820, 932, 901, 934, 1290, 1330, 1320, 1280, 1260, 1280, 1350, 1370],
  },
  barChartData: {
    title: '癌肿风险占比',
    xAxisData: [
      '胃癌',
      '乳腺癌',
      '肝癌',
      '肺癌',
      '肠癌',
      '食管癌',
      '胰腺癌',
      '血液肿瘤',
      '脑瘤',
      '前列腺癌',
      '卵巢癌',
      '甲状腺癌',
      '鼻咽癌',
      '嗜铬细胞瘤',
    ],
    seriesData: [100, 35, 35, 40, 45, 55, 55, 60, 60, 65, 65, 75, 75, 90],
  },
  stackedAreaChartData: {
    title: '渠道商检测量',
    legendData: ['江苏海尔思', '河南中平韩一', '河南圣德医院'],
    xAxisData: ['一月', '二月', '三月', '四月', '五月', '六月', '七月', '八月', '九月', '十月', '十一月', '十二月'],
    seriesData: [
      {
        id: 1,
        name: '江苏海尔思',
        color: ['rgba(0, 221, 255)', 'rgba(77, 119, 255)'],
        data: [320, 132, 201, 334, 190, 130, 220, 320, 132, 201, 334, 190, 330],
      },
      {
        id: 2,
        name: '河南中平韩一',
        color: ['rgba(128, 255, 165)', 'rgba(1, 191, 236)'],
        data: [120, 282, 111, 234, 220, 340, 310, 120, 282, 111, 234, 220, 140],
      },
      {
        id: 3,
        name: '河南圣德医院',
        color: ['rgba(55, 162, 255)', 'rgba(116, 21, 219)'],
        data: [140, 232, 101, 264, 90, 340, 250, 140, 232, 101, 264, 90, 340, 250],
      },
    ],
  },
}
